* twostkbd key code assignment
** key-gpio table
|-------+--------+---------|
| kname | PiZero | Arduino |
|-------+--------+---------|
| k0    |     23 |       5 |
| k1    |     25 |       6 |
| k2    |      7 |       7 |
| k3    |     21 |       8 |
| k4    |     16 |       9 |
| k5    |     26 |      10 |
| f0    |      4 |         |
| f1    |      8 |      17 |
| f2    |     12 |      18 |
| f3    |     20 |      21 |
| alt   |     14 |       1 |
| ctrl  |     18 |       2 |
| shift |     15 |       3 |
| ext   |     24 |       4 |
|-------+--------+---------|

** 6-key table
|-----+-----+-----+-----+-------+-----+------+-----|
| No. | key | 1st | 2nd | shift | alt | ctrl | ext |
|-----+-----+-----+-----+-------+-----+------+-----|
|   0 | a   |   0 |   0 |       |     |      | F12 |
|   1 | o   |   1 |   1 |       |     |      | ESC |
|   2 | e   |   2 |   2 |       |     |      | ,   |
|   3 | i   |   3 |   3 |       |     |      | .   |
|   4 | u   |   1 |   2 |       |     |      | (   |
|   5 | t   |   2 |   1 |       |     |      | )   |
|   6 | n   |   2 |   3 |       |     |      | "   |
|   7 | s   |   3 |   2 |       |     |      | '   |
|   8 | r   |   1 |   3 |       |     |      | -   |
|   9 | d   |   3 |   1 |       |     |      | _   |
|  10 | x   |   0 |   2 |       |     |      | F2  |
|  11 | c   |   2 |   0 |       |     |      | F7  |
|  12 | l   |   0 |   3 |       |     |      | F3  |
|  13 | f   |   3 |   0 |       |     |      | F8  |
|  14 | p   |   0 |   1 |       |     |      | F1  |
|  15 | b   |   1 |   0 |       |     |      | F6  |
|  16 | h   |   4 |   4 |       |     |      | *   |
|  17 | y   |   5 |   5 |       |     |      | ;   |
|  18 | m   |   1 |   5 |       |     |      | {   |
|  19 | g   |   5 |   1 |       |     |      | }   |
|  20 | v   |   2 |   5 |       |     |      | <   |
|  21 | k   |   5 |   2 |       |     |      | >   |
|  22 | w   |   0 |   5 |       |     |      | F5  |
|  23 | j   |   5 |   0 |       |     |      | F10 |
|  24 | q   |   3 |   5 |       |     |      | [   |
|  25 | z   |   5 |   3 |       |     |      | ]   |
|  26 | 0   |   0 |   4 |       |     |      | F4  |
|  27 | 1   |   1 |   4 | !     |     |      | +   |
|  28 | 2   |   2 |   4 | @     |     |      | /   |
|  29 | 3   |   3 |   4 | #     |     |      | \   |
|  30 | 4   |   5 |   4 | $     |     |      | :   |
|  31 | 5   |   4 |   0 | %     |     |      | F9  |
|  32 | 6   |   4 |   1 | ^     |     |      | =   |
|  33 | 7   |   4 |   2 | &     |     |      | ?   |
|  34 | 8   |   4 |   3 | VBAR  |     |      | `   |
|  35 | 9   |   4 |   5 | ~     |     |      | F11 |
|-----+-----+-----+-----+-------+-----+------+-----|
#+TBLFM: @<<<..@>$1=@-1$1+1

** fkey table
|-------+------+-------+-----+------+-----|
| f.key | func | shift | alt | ctrl | ext |
|-------+------+-------+-----+------+-----|
|     0 |      |       |     |      |     |
|     1 | BS   |       |     |      |     |
|     2 | RET  |       |     |      |     |
|     3 | SP   |       |     |      |     |
|-------+------+-------+-----+------+-----|

** multikeys table
|--------+-------------|
| func   | keys        |
|--------+-------------|
| ESC    | k0,k1,k2,k3 |
| LEFT   | k0,k1,k2    |
| RIGHT  | k0,k1,k3    |
| UP     | k0,k1,f3    |
| DOWN   | k0,k1,k5    |
| PUP    | k1,k2,f3    |
| PDOWN  | k1,k2,k5    |
| HOME   | f1,f2,f3    |
| END    | f1,f2,k5    |
| CHOME  | k0,k2,f3    |
| CEND   | k0,k2,k5    |
| CLEFT  | k0,f2,f3    |
| CRIGHT | k0,f2,k5    |
| CTLG   | k0,k1,k2,k5 |
| CTLC   | k0,k2,k3    |
| TAB    | k1,k2,k3    |
| CTLX   | k0,f2,k3    |
| ALTX   | f1,f2,k3    |
| CTL/   | k0,k1,k2,f3 |
|--------+-------------|
